greetings = "Привет, {name}, я бот, предназначенный проверки ip адресов"
menu = "📍 Главное меню"
check_menu = "📍 Меню проверки адреса"
virustotal_menu = "🔤🔤 Проверка адресов по базам virustotal"
ipinfo_menu = "🌐 Получить информацию об ip из базы ipinfo"
adbuseip_menu = "🚫 Получить информацию об ip из базы AbuseIPDB"
help = "Команды бота: \n\n\
        Общие команды: \n\
        - /start - запуск бота \n\
        - /menu - вывести основное меню \n\
        - /help - вывести команды бота \n\n\
        Команды для проверки IP \n\
        - /vt_checkip {адрес} - проверка IP по базам Virustotal\n"

about_check_ip = "📝 Введите ip адрес..."
check_ips_list = "📝 Введите ip адреса для проверки..."
send_text_file = "📝 Отправте txt файл с адресами для проверки..."
gen_exit = "Чтобы выйти из диалога с вводом ip адреса нажмите на кнопку"
gen_wait = "⏳Пожалуйста, подождите немного, пока обрабатывает ваш запрос..."
err_ip = "🚫 Произошла ошибка, неверный ip адрес"
