greet = "Привет, {name}, я бот, использующий нейросети от OpenAI, такие как ChatGPT и Dall-e. Задавай мне вопросы и я постараюсь ответить ☺️"
menu = "📍 Главное меню"


about_check_ip = "📝 Введите ip адрес..."
check_ips_list = "📝 Введите ip адреса для проверки..."
send_text_file = "📝 Отправте txt файл с адресами для проверки..."
gen_exit = "Чтобы выйти из диалога с вводом ip адреса нажмите на кнопку"
gen_wait = "⏳Пожалуйста, подождите немного, пока обрабатывает ваш запрос..."
err_ip = "🚫 Произошла ошибка, неверный ip адрес"
